---
kind: enumMember
id: F:Autodesk.Revit.DB.WallSweepOrientation.Horizontal
enum: Autodesk.Revit.DB.WallSweepOrientation
source: html/c290c137-1e53-8d4e-588a-f52d8a62122c.htm
---
# Autodesk.Revit.DB.WallSweepOrientation.Horizontal

Profile is oriented horizontally regardless of wall slant angle